Revit 2024 API
ElectricalSetting.SetSpecificFittingAngleStatus Method
 Sets the status of given specific angle.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void SetSpecificFittingAngleStatus(
	double angle,
	bool bStatus
)
Visual Basic
Public Sub SetSpecificFittingAngleStatus ( _
	angle As Double, _
	bStatus As Boolean _
)
Visual C++
public:
void SetSpecificFittingAngleStatus(
	double angle,
	bool bStatus
)
Parameters
angle
Type: System.Double
 The specific angle (in degree) that must be 60, 45, 30, 22.5 or 11.25 degrees.
bStatus
Type: System.Boolean
 Status, true - using the given angle during the pipe layout.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for angle must be 90, 60, 45, 30, 22.5 or 11.25 degrees.
Autodesk.Revit.Exceptions.InvalidOperationException |  Can not set an angle status for an invalid angle.
See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace